## Working with Missing Data in Pandas

In [1]:
import numpy as np
import pandas as pd

from pandas import DataFrame

### Filling missing values using fillna(), replace() and interpolate()

In [2]:
data = {'names': ['Steve', 'mary', 'joseph', 'Gabriel'],
        'age': [10, 20, 30, 40],
        'gender': ['male', 'female', 'male', 'male'],
        'rank': [2,5,1,3]
    }

ranking_df = DataFrame(data)
ranking_df.iloc[2:5, 1] = np.nan
ranking_df.iloc[2:1, 1] = np.nan
#set all columns to nan
ranking_df.iloc[3,:] = np.nan

ranking_df

    names   age  gender  rank
0   Steve  10.0    male   2.0
1    mary  20.0  female   5.0
2  joseph   NaN    male   1.0
3     NaN   NaN     NaN   NaN

isNull  returns true for missing and notNull returns true for not null

In [3]:
ranking_df.isnull()

   names    age  gender   rank
0  False  False   False  False
1  False  False   False  False
2  False   True   False  False
3   True   True    True   True

In [4]:
ranking_df.notnull()

   names    age  gender   rank
0   True   True    True   True
1   True   True    True   True
2   True  False    True   True
3  False  False   False  False

masking to show missing values in column

In [5]:
bool_series = pd.isnull(ranking_df['age'])
ranking_df[bool_series]

    names  age gender  rank
2  joseph  NaN   male   1.0
3     NaN  NaN    NaN   NaN

fill missing values with a value

In [6]:
ranking_df.fillna(0)

    names   age  gender  rank
0   Steve  10.0    male   2.0
1    mary  20.0  female   5.0
2  joseph   0.0    male   1.0
3       0   0.0       0   0.0

fill the missing values with the previous value

In [12]:
ranking_df = ranking_df.ffill(inplace=True)

ranking_df

    names   age  gender  rank
0   Steve  10.0    male   2.0
1    mary  20.0  female   5.0
2  joseph  20.0    male   1.0
3  joseph  20.0    male   1.0